## Plan for aft/notifications
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                   NAME                                                    |
|--------|-----------------------------------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.pipeline_failed[&quot;/aws/codebuild/aft-account-customizations-terraform&quot;]` |
|        | `aws_cloudwatch_log_metric_filter.pipeline_failed[&quot;/aws/codebuild/aft-global-customizations-terraform&quot;]`  |
|        | `aws_cloudwatch_metric_alarm.pipeline_failed[&quot;/aws/codebuild/aft-account-customizations-terraform&quot;]`      |
|        | `aws_cloudwatch_metric_alarm.pipeline_failed[&quot;/aws/codebuild/aft-global-customizations-terraform&quot;]`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.pipeline_failed["/aws/codebuild/aft-account-customizations-terraform"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pipeline_failed" {
      + id             = (known after apply)
      + log_group_name = "/aws/codebuild/aft-account-customizations-terraform"
      + name           = "PipelineFailed"
      + pattern        = "FAILED"

      + metric_transformation {
          + default_value = "0"
          + name          = "PipelineFailed-codebuild"
          + namespace     = "AFT"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.pipeline_failed["/aws/codebuild/aft-global-customizations-terraform"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pipeline_failed" {
      + id             = (known after apply)
      + log_group_name = "/aws/codebuild/aft-global-customizations-terraform"
      + name           = "PipelineFailed"
      + pattern        = "FAILED"

      + metric_transformation {
          + default_value = "0"
          + name          = "PipelineFailed-codebuild"
          + namespace     = "AFT"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.pipeline_failed["/aws/codebuild/aft-account-customizations-terraform"] will be created
  + resource "aws_cloudwatch_metric_alarm" "pipeline_failed" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
        ]
      + alarm_description                     = "AFT pipeline execution has failed"
      + alarm_name                            = "PipelineFailed-codebuild"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "PipelineFailed-codebuild"
      + namespace                             = "AFT"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.pipeline_failed["/aws/codebuild/aft-global-customizations-terraform"] will be created
  + resource "aws_cloudwatch_metric_alarm" "pipeline_failed" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
        ]
      + alarm_description                     = "AFT pipeline execution has failed"
      + alarm_name                            = "PipelineFailed-codebuild"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "PipelineFailed-codebuild"
      + namespace                             = "AFT"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pipeline_failed[\"/aws/codebuild/aft-account-customizations-terraform\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pipeline_failed[\"/aws/codebuild/aft-global-customizations-terraform\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_failure_notifications.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_failure_notifications.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_failure_notifications.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_failure_notifications.aws_lambda_function.notify_slack"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
